chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
/**
 * STM32H7S78-DK 電子相簿。
 *
 * 面板是 800x480 橫式，但照片是直式，所以整個 UI 跟照片都轉 90 度當成
 * 480x800 直立畫面用（gfx.c 負責座標轉換）。
 *
 * 流程：掛載 SD -> 掃描一次建立完整照片清單 -> 勾選最上層資料夾 -> 隨機播放。
 * 勾選只是過濾既有清單，不會重新掃卡。
 *
 * 整支程式對 SD 卡只讀不寫，磁碟層也回報寫入保護。
 */
#include "main.h"
#include "stm32h7s78_discovery.h"
#include "stm32h7s78_discovery_lcd.h"
#include "stm32h7s78_discovery_ts.h"
#include "stm32h7s78_discovery_sd.h"

#include "ff.h"
#include "ff_gen_drv.h"

#include "gfx.h"
#include "photo.h"
#include "video.h"
#include "favorites.h"
#include "vbus.h"
#include "usbdrive.h"
#include "audio_out.h"

#include <string.h>
#include <stdbool.h>
#include <stdio.h>

extern const Diskio_drvTypeDef SD_BSP_Driver;

/* 磁碟層在等卡片時會呼叫這個，讓長時間的等待不會被看門狗打掉。 */
void sd_bsp_set_keepalive(void (*fn)(void));

/* 1 = 開機解一張就停住，方便用 SWD 把緩衝區讀出來對照。 */
#define DEBUG_ONE_SHOT  0

#define FB0_ADDR        LCD_LAYER_0_ADDRESS      /* 0x90000000 */
#define FB1_ADDR        LCD_LAYER_1_ADDRESS      /* 0x90200000 */

#define COL_BG          RGB565(16, 18, 24)
#define COL_TEXT        RGB565(236, 238, 245)
#define COL_DIM         RGB565(140, 146, 160)
#define COL_ACCENT      RGB565(78, 154, 241)
#define COL_PANEL       RGB565(30, 34, 44)
#define COL_LINE        RGB565(54, 60, 74)
#define COL_HEART       RGB565(232, 72, 96)

#define MAX_TOP         64U
#define MAX_PHOTOS      8192U
/* 完整路徑上限。中文/日文一個字 3 bytes，加上多層子資料夾很容易超過 128，
 * 超過的照片會被跳過。PSRAM 還有空間，放寬到 256 免得使用者莫名其妙少照片。 */
#define PATH_MAX        256U
#define NAME_MAX        96U
#define MAX_DEPTH       10U
#define SCAN_PATH_LEN   512U

/* 清單放 PSRAM：8192 x 256 = 2MB，內部 RAM 放不下。
 * 位置接在 photo.c 的縮圖緩衝區之後（見那邊的記憶體配置表）。 */
#define PLAYLIST_BASE   ((char *)0x91C00000u)     /* 8192 x 256 = 2 MB */
#define TOPIDX_BASE     ((uint8_t *)0x91E00000u)  /* 8 KB */

typedef struct {
    char     name[NAME_MAX];
    uint32_t photos;
    bool     selected;
} top_t;

static top_t    g_top[MAX_TOP];
static uint32_t g_top_count;
static uint32_t g_photo_count;

static uint16_t g_order[MAX_PHOTOS];
static uint32_t g_order_count;

static FATFS    g_fs;
static char     g_drive[4];
static DIR      g_dir[MAX_DEPTH];
static FILINFO  g_fno[MAX_DEPTH];
static char     g_scan_path[SCAN_PATH_LEN];
static uint32_t g_cur_top;

static uint32_t g_front;
static uint32_t g_interval_s = 2;      /* 預設 2 秒，可調 2~5 */

/* 播放順序。預設隨機 —— 相框是隨手看的，固定順序會一直看到同幾張。
 * 想照資料夾原本的順序（通常等於時間順序）就切成循序。 */
static bool g_shuffle = true;
static const char *const SEQ_NAME[2] = { "隨機", "循序" };

#define SCROLL_MIN_DY 24        /* 選單清單：拉多少才算捲動而不是點選 */
#define SWIPE_GAP_MS  150u      /* 容忍觸控中途漏報多久（board-notes 14.7）*/

/* 開機掃描完是否直接開播。
 *
 * 預設 0 = 停在選單，讓使用者確認要播哪些資料夾再開始（資料夾本來就
 * 預設全選，所以通常按一下「開始播放」就好）。
 *
 * 設 1 = 掃描完直接播，插電就會動。這是**除錯用**的：板子沒有 UART，
 * 每次驗證都要「燒錄 -> 手動勾資料夾 -> 按開始」，一個 session 重複十幾次
 * 而中間的手動步驟沒有任何除錯價值。要遠端自動驗證時用
 * `CFLAGS=-DAUTO_PLAY=1` 編一版即可。 */
#ifndef AUTO_PLAY
#define AUTO_PLAY 0
#endif

/* 診斷用，SWD 讀得到。 */
volatile uint32_t g_stage;
volatile int32_t  g_err;
volatile uint32_t g_decode_ok;
volatile uint32_t g_decode_fail;

/* 卡片「還插著但不再回應」的偵測。
 *
 * 寫入失敗會讓這張卡進 BUSY 就再也不回來，之後**連讀取都失敗**。
 * 那時每一張照片都解不開，而翻頁迴圈會把整份清單試一遍再重來 ——
 * 迴圈裡有乖乖餵狗，所以看門狗不會救，結果是永遠空轉：
 * 實測 g_decode_fail 衝到 1,511,732，使用者看到的就是「卡死」。
 *
 * 連續失敗超過門檻就判定卡片掛了，跳出去做一次完整的重新初始化。
 * 門檻要大於「偶爾一張壞檔」但遠小於整份清單。 */
#define CARD_SICK_RUN   24u
/* 連續幾張「解不開」就跳出來提示。
 *
 * **門檻要跟清單大小取小的那個。** 寫死 8 的話，只有一兩張照片的資料夾
 * 永遠湊不到，畫面還是什麼都不說 —— 使用者用「一張不支援的圖」測就踩到了。
 * 一張圖的清單失敗一次，就已經是「全部都不行」了。
 *
 * 反過來，大清單裡偶爾一兩張壞檔很正常，不該打斷播放，所以上限留 8。 */
#define BAD_PHOTO_RUN   8u

static uint32_t g_bad_photo_run;   /* 連續解不開幾張（卡片是好的）*/
static bool     g_bad_photo_told;  /* 這次播放已經提示過了 */
static uint32_t g_read_fail_run;
static bool     g_card_sick;

volatile uint32_t g_dbg_card_sick;      /* 判定過幾次 */
volatile uint32_t g_dbg_card_recover;   /* 重新初始化過幾次 */

/* **「卡片讀不到」與「照片解不開」要分開算。**
 *
 * 原本兩種都往同一個計數器加，24 次就判定卡片壞掉去做重新初始化。
 * 但照片解不開的時候卡片是好的 —— 於是恢復、再失敗、再恢復，無限循環，
 * 畫面看起來就是當機。使用者實際踩過：一個資料夾 66 張裡 64 張是
 * progressive JPEG（硬體只吃 baseline），整個相簿像卡死。
 *
 * 現在只有 PHOTO_ERR_READ 會累積到卡片壞掉的判定；解不開／太大另外算，
 * 由播放迴圈顯示訊息並回選單。 */
static void note_decode(photo_result_t r)
{
    if (r == PHOTO_OK) {
        g_decode_ok++;
        g_read_fail_run = 0;
        g_bad_photo_run = 0;
        return;
    }
    g_decode_fail++;

    if (r == PHOTO_ERR_READ) {
        if (++g_read_fail_run >= CARD_SICK_RUN && !g_card_sick) {
            g_card_sick = true;
            g_dbg_card_sick++;
        }
    } else {
        g_bad_photo_run++;   /* 卡片沒事，是照片本身 */
    }
}
volatile uint32_t g_last_ms;
volatile uint32_t g_exit_touch;   /* 因觸控離開播放的次數 */
volatile uint32_t g_skipped_long; /* 路徑太長被跳過的照片數 */
volatile uint32_t g_skipped_full; /* 清單滿了之後被跳過的照片數 */
volatile uint32_t g_paused;
/* 手感問題的診斷計數 */
volatile uint32_t g_dbg_btn_edge;    /* 按鍵中斷進來幾次 */
volatile uint32_t g_dbg_btn_short;   /* 判定為短按 */
volatile uint32_t g_dbg_btn_long;    /* 判定為長按 */
volatile uint32_t g_dbg_touch_hit;   /* 暫停中 read_touch 讀到觸碰幾次 */
volatile int32_t  g_dbg_swipe_dx;    /* 最後一次滑動的位移 */
volatile int32_t  g_dbg_swipe_dy;       /* 1 = 播放暫停中（畫面凍結）*/

/* ------------------------------------------------------------------ */
/* 基礎設施                                                            */
/* ------------------------------------------------------------------ */

/* PSRAM 分兩種快取政策，依「有沒有硬體會碰這塊記憶體」來切。
 *
 * 下半 16MB（0x90000000~0x90FFFFFF）維持 write-through，因為裡面有兩塊
 * 是 CPU 與硬體共用的：framebuffer 被 LTDC 每秒讀 60 次，JPEG 原始檔會被
 * JPEG 硬體讀走。write-through 保證 CPU 寫下去的內容立刻在記憶體裡。
 *
 * 上半 16MB（0x91000000~0x91FFFFFF）改成 write-back。這塊全部是 CPU 自己
 * 的暫存 —— RGB888 全尺寸、縮圖、播放清單、資料夾索引、圖示備份 ——
 * 沒有任何硬體會讀，所以不需要任何快取維護動作。
 *
 * 為什麼要分：write-through 在 ARMv7-M 是「不做 write-allocate」，而原本
 * 這裡還加上 NOT_BUFFERABLE，連寫入緩衝都關掉 —— 每一個 byte store 都變成
 * 一次獨立、同步、不能合併成 burst 的 PSRAM 交易。實測轉色每像素要 121 個
 * 週期（查表換算合理值是 15~25），銳化那段更高到 473，多出來的全是在等
 * 匯流排。改成 write-back 之後，連續的 byte store 會先在快取線裡累積，
 * 整條 32 bytes 一次 burst 出去。
 *
 * 重疊時編號大的優先，所以上半部用第 8 號蓋掉第 7 號那片 32MB。 */
static void psram_mpu_init(void)
{
    MPU_Region_InitTypeDef mpu = {0};

    HAL_MPU_Disable();

    mpu.Enable           = MPU_REGION_ENABLE;
    mpu.Number           = MPU_REGION_NUMBER7;
    mpu.BaseAddress      = 0x90000000u;
    mpu.Size             = MPU_REGION_SIZE_32MB;
    mpu.AccessPermission = MPU_REGION_FULL_ACCESS;
    mpu.IsShareable      = MPU_ACCESS_NOT_SHAREABLE;
    mpu.IsCacheable      = MPU_ACCESS_CACHEABLE;
    mpu.IsBufferable     = MPU_ACCESS_NOT_BUFFERABLE;   /* write-through */
    mpu.TypeExtField     = MPU_TEX_LEVEL0;
    mpu.SubRegionDisable = 0x00;
    mpu.DisableExec      = MPU_INSTRUCTION_ACCESS_DISABLE;
    HAL_MPU_ConfigRegion(&mpu);

