chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
    /* TEX=1 + C=1 + B=1 就是 write-back 且讀寫都 allocate。
     * write-allocate 是重點：寫入未命中時先把整條快取線讀進來，之後同一條線
     * 上的寫入全部命中，最後整條一次寫回，這樣才有 burst。 */
    mpu.Number           = MPU_REGION_NUMBER8;
    mpu.BaseAddress      = 0x91000000u;
    mpu.Size             = MPU_REGION_SIZE_16MB;
    mpu.IsCacheable      = MPU_ACCESS_CACHEABLE;
    mpu.IsBufferable     = MPU_ACCESS_BUFFERABLE;
    mpu.TypeExtField     = MPU_TEX_LEVEL1;
    HAL_MPU_ConfigRegion(&mpu);

    HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);

    SCB_CleanInvalidateDCache();
}

static void screen_init(void)
{
    /* BSP 預設 ARGB8888（每像素 4 bytes），我們畫的是 16 位元，
     * 不指定 RGB565 的話會用錯的列距去讀，畫面會橫向重複。 */
    if (BSP_LCD_InitEx(0, LCD_ORIENTATION_LANDSCAPE, LCD_PIXEL_FORMAT_RGB565,
                       PHYS_W, PHYS_H) != BSP_ERROR_NONE) {
        Error_Handler();
    }

    for (uint32_t i = 0; i < (uint32_t)PHYS_W * PHYS_H; i++) {
        ((uint16_t *)FB0_ADDR)[i] = 0;
        ((uint16_t *)FB1_ADDR)[i] = 0;
    }

    BSP_LCD_SetLayerAddress(0, 0, FB0_ADDR);
    /* no-reload：位址只寫進 shadow register，等我們要求垂直消隱重載才生效。
     * 否則 SetLayerAddress 會在畫面掃描途中重寫整組暫存器而撕裂。 */
    BSP_LCD_Reload(0, BSP_LCD_RELOAD_NONE);
    BSP_LCD_DisplayOn(0);

    g_front = 0;
    gfx_set_framebuffer((uint16_t *)FB1_ADDR);
}

/* 黑盒子（重置洗不掉的觀察管道）。定義放在這裡是因為 present() 要用，
 * 完整的欄位說明與「為什麼放 DTCM」寫在下面的 bbox_boot()。 */
#define BBOX        ((volatile uint32_t *)0x20004020u)
#define BBOX_MAGIC  0x424F5831u   /* "BOX1" */

static void present(void)
{
    uint32_t drawn = g_front ? FB0_ADDR : FB1_ADDR;
    bool     reloaded = false;

    /* 只寫 CFBAR 一個暫存器：它是 shadow register，寫入不會立即生效，
     * 等垂直消隱重載時整批原子切換，中間沒有半完成狀態。 */
    LTDC_Layer1->CFBAR = drawn;
    LTDC->SRCR = LTDC_SRCR_VBR;
    for (uint32_t guard = 0; guard < 2000000u; guard++) {
        if ((LTDC->SRCR & LTDC_SRCR_VBR) == 0u) {
            reloaded = true;
            break;
        }
    }

    /* **等不到垂直消隱重載 = 面板沒在掃描 = 畫面凍住。**
     * 這個保險迴圈原本是靜靜地逾時然後往下走，於是「畫面不動但程式還活著」
     * 完全沒有跡象。數它一次就分得出「相簿卡住」與「相簿好好的、只是
     * 畫面停在最後一幀」—— 這兩件事在螢幕上長得一模一樣。 */
    BBOX[15]++;
    if (!reloaded) { BBOX[14]++; }

    g_front ^= 1u;
    gfx_set_framebuffer((uint16_t *)(g_front ? FB0_ADDR : FB1_ADDR));
}

/* 睡到下一個中斷才醒，用來取代輪詢迴圈裡的 HAL_Delay()。
 *
 * HAL_Delay() 是忙等 —— 核心全速空轉一直讀 uwTick，600MHz 的 M7 這樣燒電
 * 很不划算。相簿大部分時間都在等（每張顯示 2~5 秒、解碼只佔 1.5 秒），
 * 所以這裡是最值得省的地方。
 *
 * __WFI() 讓核心停住，直到有中斷才繼續。SysTick 每 1ms 一次，所以每毫秒
 * 醒一下、其餘時間都在睡，等待的精度不變但核心幾乎不耗電。
 *
 * 注意：中斷必須是開著的，否則會永遠睡下去。這裡是主迴圈，沒有關中斷的
 * 情況；如果哪天在臨界區裡呼叫就會卡死。 */
/* **開發期把睡眠關掉。**
 *
 * album_run() 裡已經有 HAL_DBGMCU_EnableDBGSleepMode()，理論上睡著也連得上
 * SWD。但這塊板子上實測不成立：相簿停在選單（每圈 nap(30)，幾乎整段時間
 * 都在睡）時，mode=HOTPLUG 連續 15 次全部連不上，報 "Unable to get core ID"；
 * 換頻率、換連線模式都一樣，只有 mode=UR（連線時按住重置，核心還來不及睡）
 * 連得上 —— 而 UR 會重置，等於把要觀察的狀態洗掉。
 *
 * 順帶量到的：`DBGMCU->CR` 讀出來是 0x10036485，**DBGCKEN（bit21）是 0**，
 * 而且從應用程式寫它也寫不進去。所以那個 HAL 呼叫沒有真的解決問題。
 *
 * 沒有 SWD 就沒有任何觀察手段（板子沒有 UART），音訊這一輪每一步都要靠
 * 讀全域變數驗證，所以開發期一律忙等。這台是插著電的相框，省電不是重點。 */
#define NAP_USE_WFI   0

static void nap(uint32_t ms)
{
    uint32_t t0 = HAL_GetTick();

    while ((HAL_GetTick() - t0) < ms) {
#if NAP_USE_WFI
        __WFI();
#endif
    }
}

static void rnd_mix(uint32_t v);      /* 定義在下面的亂數區塊 */
static void watchdog_feed(void);      /* 定義在下面的記憶卡狀態區塊 */
static bool sd_present(void);
static void show_scan_progress(void);
static bool screen_poll(void);
static void show_message(const char *line1, const char *line2);
static void draw_name_clipped(int x, int y, const char *s, int limit,
                              uint16_t color);

/* 觸控座標換成直立座標。
 * gfx 把邏輯 (x,y) 映到實體 offset (GFX_W-1-x)*PHYS_W + y，
 * 也就是實體列 = GFX_W-1-x、實體行 = y，反過來就是下面這樣。 */
static bool read_touch(int *x, int *y)
{
    TS_State_t st;

    if (BSP_TS_GetState(0, &st) != BSP_ERROR_NONE || !st.TouchDetected) {
        return false;
    }
    *x = (int)GFX_W - 1 - (int)st.TouchY;
    *y = (int)st.TouchX;

    /* 每一次觸控都是一次熵注入。 */
    rnd_mix(HAL_GetTick() + ((uint32_t)*x << 16) + (uint32_t)*y);
    return true;
}

/* 等到手指真的放開。
 *
 * 電容觸控在放開的瞬間會彈跳，讀到「沒碰到」不代表真的離開了。要連續數次
 * 都讀不到才算數，否則殘留的事件會被下一段程式碼當成新的觸碰 —— 進入播放
 * 後第一張照片立刻被判定成「使用者要離開」就是這樣來的。 */
static void wait_release(void)
{
    uint32_t t0 = HAL_GetTick();
    int clean = 0;
    int x, y;

    while (clean < 4) {
        watchdog_feed();
        if (read_touch(&x, &y)) {
            clean = 0;
            if (HAL_GetTick() - t0 > 3000u) {
                break;                  /* 觸控卡住就不要一直等 */
            }
        } else {
            clean++;
        }
        nap(10);
    }
    nap(40);
}


static uint32_t rnd_state = 0x2545F491u;

/* 把外部熵混進種子。
 *
 * 原本只用「開機到掃描完的時間」當種子，但那段耗時相當固定（SD 初始化加上
 * 掃描固定數量的檔案），每次開機常常拿到同一個毫秒數 —— 同種子就是同一組
 * 順序，看起來就像沒有隨機。
 *
 * 使用者按下螢幕的時間點才是真正不可預測的：以毫秒計沒有人按得出重複，
 * 再加上 CPU 週期計數器（600MHz，同一毫秒內還有六十萬個刻度）與觸控座標，
 * 每一次觸碰都會讓後續的順序完全不同。 */
static void rnd_mix(uint32_t v)
{
    rnd_state ^= v * 2654435761u;
    rnd_state ^= DWT->CYCCNT;
    rnd_state = (rnd_state << 7) | (rnd_state >> 25);
    if (rnd_state == 0u) {
        rnd_state = 0x2545F491u;
    }
}

static uint32_t rnd(void)
{
    rnd_state ^= rnd_state << 13;
    rnd_state ^= rnd_state >> 17;
    rnd_state ^= rnd_state << 5;
    return rnd_state;
}

/* ------------------------------------------------------------------ */
/* 記憶卡狀態與看門狗                                                  */
/* ------------------------------------------------------------------ */

static IWDG_HandleTypeDef g_iwdg;
static bool g_wdt_on;

/* 獨立看門狗，用來兜住「卡片沒回應」這個沒辦法從程式裡跳出來的情況。
 *
 * BSP_SD_Init() 最終會走到 HAL 的 SD_InitCard()，裡面有
 *   while (sd_rca == 0U)
 * 這個迴圈沒有逾時保護。卡片若停在異常狀態不回應 CMD3，程式就永遠出不來，
 * 畫面停在「載入中」而且沒有任何提示 —— 使用者只會覺得機器壞了。
 *
 * 同一個執行緒沒辦法讓自己跳出無窮迴圈，只能靠硬體。逾時設 16 秒，正常
 * 操作（解一張照片約 0.5 秒、掃描一次約 1 秒）遠遠用不到。 */
/* ------------------------------------------------------------------ */
/* 黑盒子：重置洗不掉的觀察管道                                        */
/* ------------------------------------------------------------------ */
/**
 * 為什麼需要這個：SWD 的 mode=HOTPLUG 現在完全連不上（連續 15 次全失敗，
 * 報 "Unable to get core ID"），只有 mode=UR 連得上 —— 而 UR 會重置板子，
 * 等於把要觀察的狀態洗掉。全域變數在 .bss，開機就被清成 0，所以「重置之後
 * 再讀」讀到的永遠是新一輪的初值，看不到上一輪發生了什麼。
 *
 * 這塊放 DTCM。board-notes 22.5 已經實測過：bootloader 的堆疊在 AXI SRAM，
 * 完全不碰 DTCM，寫進去重置後原封不動（那一章就是靠這個發現「暗號被
 * bootloader 踩掉」的）。連結腳本給相簿的 DTCM 只有 0x20000000 起 4KB
 * （_estack = 0x20001000），所以 0x20004020 這裡沒有人用。
 *
 * 而且啟動碼不會清它 —— 它不是 .data 也不是 .bss。這正是重點：
 * **上一輪的紀錄活得過重置。**
 */
/* [0] 魔術字   [1] 開機次數（累計）
 * [2] 上一輪最後到達的 g_stage      [3] 上一輪最後一次餵狗的 uwTick
 * [4] 這一輪開機時的 RCC->RSR       [5] 這一輪的 g_stage（即時）
 * [6] 這一輪最後一次餵狗的 uwTick   [7] 餵狗次數（這一輪）
 * [8] mount_and_scan 進來幾次       [9] sd_present() 回報「沒卡」幾次
 * [10] sd_present() 總共問了幾次    [11] 最後一次掃完的 g_photo_count
 * [12] select_screen 進來幾次       [13] slideshow 進來幾次
 * [14] present() 等不到重載幾次     [15] present() 呼叫幾次
 *
 * [16] 音訊測試請求（Hz，外面寫、韌體吃掉）
 * [17..24] 音訊測試結果：step / init / pll / sel / play / half / full / err
 * [25] 測試跑完時的 uwTick
 *
 * **[16] 以後開機不清空。** 請求是在重置點寫進來的（那時韌體還沒跑），
 * 清掉就等於永遠收不到；結果則要活過下一次重置才讀得到。 */
static void bbox_boot(uint32_t rsr)
{
    if (BBOX[0] != BBOX_MAGIC) {    /* 斷電後第一次：內容是隨機的 */
        BBOX[0] = BBOX_MAGIC;
        BBOX[1] = 0u;
        BBOX[5] = 0u;
        BBOX[6] = 0u;
    }
    BBOX[1]++;                      /* 開機次數：一秒跳好幾次就是重置迴圈 */
    BBOX[2] = BBOX[5];              /* 把上一輪的即時值搬到「上一輪」欄 */
    BBOX[3] = BBOX[6];
    BBOX[4]  = rsr;
    BBOX[39] = BBOX[26];        /* 上一輪的開機腳印走到哪 */
    BBOX[26] = 0u;
    BBOX[5]  = 0u;
    BBOX[6]  = 0u;
    BBOX[7]  = 0u;
    BBOX[8]  = 0u;
    BBOX[9]  = 0u;
    BBOX[10] = 0u;
    BBOX[11] = 0u;
    BBOX[12] = 0u;
    BBOX[13] = 0u;
    BBOX[14] = 0u;
    BBOX[15] = 0u;
}

/* 把音訊的診斷變數抄進黑盒子。.bss 活不過重置，DTCM 活得過 ——
 * 而現在唯一能連上的 mode=UR 一定會重置，所以不抄就讀不到。 */
static void bbox_audio_snapshot(void)
{
    BBOX[17] = g_dbg_aud_step;
    BBOX[18] = g_dbg_aud_init;
    BBOX[19] = g_dbg_aud_pll;
    BBOX[20] = g_dbg_aud_sel;
    BBOX[21] = g_dbg_aud_play;
    if (g_dbg_aud_step != 0u) {     /* 這一輪真的跑過音訊才更新 */
        BBOX[22] = g_dbg_aud_half;
        BBOX[23] = g_dbg_aud_full;
        BBOX[24] = g_dbg_aud_err;
    }
    BBOX[25] = HAL_GetTick();

    /* 時脈的現場。音訊唯一動到的全域資源就是時脈樹（PLL3 + SPI6 選源），
     * 而 PSRAM(XSPI1) 與外部 NOR(XSPI2) 都吃 PLL2 —— 所以先確認 PLL2
     * 還在不在，再去碰任何一塊 PSRAM。順序很重要：這幾行都是讀暫存器，
     * 不碰 PSRAM，所以就算 PSRAM 已經壞了也記得下來。 */
    BBOX[32] = RCC->CR;          /* PLL1/2/3 的 ON 與 RDY 位元 */
    BBOX[33] = RCC->CKPROTR;     /* XSPI 的時脈保護有沒有跳到回復檔位 */
    BBOX[34] = RCC->CFGR;
    BBOX[35] = XSPI1->SR;

    /* PSRAM 探針：show_message() 一畫東西就是寫 framebuffer（PSRAM），
     * 而板子正好掛在那裡。先自己戳一下，把「掛在存取 PSRAM」這件事
     * 變成可以看見的：停在 0xAA 就代表讀不回來。 */
    BBOX[36] = 0xAAu;
    BBOX[37] = *(volatile uint32_t *)0x90000000u;
    BBOX[36] = 0xBBu;
    *(volatile uint32_t *)0x90000010u = 0x5A5A1234u;
    BBOX[36] = 0xCCu;
    BBOX[38] = *(volatile uint32_t *)0x90000010u;
    BBOX[36] = 0xDDu;
}

static void watchdog_start(void)
{
    g_iwdg.Instance       = IWDG;
    g_iwdg.Init.Prescaler = IWDG_PRESCALER_256;   /* LSI 32kHz / 256 = 125Hz */
    g_iwdg.Init.Reload    = 2000u;                /* 2000 / 125 = 16 秒 */
    g_iwdg.Init.Window    = IWDG_WINDOW_DISABLE;
    if (HAL_IWDG_Init(&g_iwdg) == HAL_OK) {
        g_wdt_on = true;
    }
}

