chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
/* 所有可能久留的迴圈裡都要餵，否則會被誤判成當機而重置。 */
volatile uint32_t g_scan_ms;       /* 掃卡耗時，毫秒 */
volatile uint32_t g_usb_since;     /* VBUS 從何時開始持續有電 */
volatile uint32_t g_usb_pending;   /* VBUS 出現了，等安全點再切換 */

bool sd_bsp_write_unlocked(void);   /* 定義在 core/sd_bsp_diskio.c */

static void watchdog_feed(void)
{
    if (g_wdt_on) {
        (void)HAL_IWDG_Refresh(&g_iwdg);
    }

    /* 黑盒子的即時欄。watchdog_feed 是全域最常被呼叫的地方（所有可能久留的
     * 迴圈都會經過），所以這裡記的「最後一次」就是「它活到哪裡為止」。 */
    BBOX[5] = g_stage;
    BBOX[6] = HAL_GetTick();
    BBOX[7]++;

    /* 音訊的回呼計數要**持續**更新，不能只在測試當下拍一次快照 ——
     * DMA 有沒有真的在跑，看的就是這兩個數字會不會一直往上跳。
     * 「聽起來好像有聲音」不可靠，這個可靠。 */
    BBOX[22] = g_dbg_aud_half;
    BBOX[23] = g_dbg_aud_full;
    BBOX[24] = g_dbg_aud_err;

    /* 順便偵測 USB 線插上沒。這裡只是讀一個暫存器（連續轉換模式一直在跑），
     * 而 watchdog_feed 本來就是全域最常被呼叫的地方 —— 不必另外找地方輪詢。
     *
     * **這裡只舉旗，不切換。** watchdog_feed 會從很深的地方被呼叫，包含
     * 正在寫「我的最愛」的當下 —— 在那裡重置會把清單檔寫壞。真正的切換
     * 放在主迴圈頂端，那裡保證不在寫卡。 */
    g_usb_pending = vbus_present() ? 1u : 0u;   /* 跟著 VBUS 走，不要單向鎖住 */

    /* 插上 USB 就讓位給隨身碟（不會返回）。
     *
     * **動作放在這裡，不是放在各個迴圈裡。** 先前只在播放迴圈與選單迴圈
     * 放檢查點，結果相簿停在第三種狀態時就不會切換 —— 一個一個補是打地鼠。
     * watchdog_feed 是全域最常被呼叫的地方，涵蓋所有狀態。
     *
     * 唯一不能重置的時機是正在寫卡（會把「我的最愛」寫壞）。直接問既有的
     * 寫入鎖，不另外發明一個要同步的旗標。 */
    /* **要連續一秒讀到才算數。** 原本是讀到一次就切，但切過去是單向的
     * （隨身碟 app 沒有自動回程），所以任何一次誤判都會黏住 ——
     * 症狀是「拔掉線按 reset 回不來」。最可能的誤判來源是拔線瞬間
     * 線材與板子上的電容還殘留著 5V，這時開機就會讀到「有電」。 */
    if (g_usb_pending && !sd_bsp_write_unlocked()) {
        uint32_t now = HAL_GetTick();

        if (g_usb_since == 0u) { g_usb_since = now; }
        else if ((now - g_usb_since) > 1000u) { usbdrive_request_switch(); }
    } else {
        g_usb_since = 0u;
    }
}

static bool sd_present(void)
{
    bool present = (BSP_SD_IsDetected(0) == SD_PRESENT);

    /* 這支腳一旦跳一下，播放/選單迴圈就會跳出去重新掛載並重掃 ——
     * 螢幕上看起來就是「一直停在載入中」。所以要數它，不要只用它。 */
    BBOX[10]++;
    if (!present) { BBOX[9]++; }
    return present;
}

/* ------------------------------------------------------------------ */
/* USER 按鈕：螢幕開關                                                 */
/* ------------------------------------------------------------------ */

/* 亮度分檔。人眼對亮度的感知接近對數，線性分檔（100/75/50/25）看起來
 * 差別很小 —— 25% 佔空比看起來大約還有一半亮。所以改成感知上等距的級距。 */
static void brightness_set(uint32_t pct);   /* 定義在下面，中斷會直接呼叫 */

static const uint8_t BRIGHT_STEP[] = { 100u, 50u, 20u, 6u, 0u };
#define BRIGHT_STEPS  (sizeof(BRIGHT_STEP) / sizeof(BRIGHT_STEP[0]))

static uint32_t         g_bright_idx;      /* 指向 BRIGHT_STEP */
static uint32_t         g_brightness = 100u;
static bool             g_screen_on  = true;

/* 觸控維持輪詢，不要用 BSP_TS_EnableIT()。
 *
 * 踩過的雷：啟用觸控中斷之後，ISR 只清了 EXTI 的旗標，沒有去讀 GT911 的
 * 狀態暫存器。控制器的資料沒被取走就不再回報新的觸碰，於是
 * BSP_TS_GetState() 之後永遠回傳「沒碰到」—— 症狀是觸控整個失效。
 *
 * 要正確使用中斷，回呼裡必須把資料讀走（等於還是要做一次 I2C 交易），
 * 省不到什麼。而且現在的控制是按鍵負責、觸控只在暫停時判滑動，輪詢完全
 * 夠用。 */



/* USER 鍵三段手勢，全部在中斷裡判斷：
 *
 *   短按 (<600ms)    切換背光亮度（立刻套用）
 *   長按 (>=600ms)   暫停 / 繼續播放
 *
 * 沒有「更長按」這一段：使用者反映很容易不小心按過頭，本來只想暫停卻跳回
 * 選單。回選單改由暫停中往下滑提供 —— 用時間長度區分三段操作，對手指來說
 * 太難拿捏。
 *
 * BSP 預設是 GPIO_MODE_IT_FALLING（下拉、按下為高），中斷只在放開時觸發，
 * 量不出按了多久。這裡改成雙邊緣，在中斷裡讀腳位判斷是按下還是放開：
 * 按下記時間、放開算長度再分派。
 *
 * 亮度直接在中斷裡套用（只寫 GPIO 與 LPTIM 暫存器，很快）；暫停與回選單
 * 要主迴圈配合，所以立旗標，並由 photo_show() 的中斷檢查即時放棄解碼 ——
 * 否則按下去要等解碼那 1.5 秒跑完才有反應。 */
#define PRESS_LONG_MS   600u

static volatile uint8_t  g_req_pause;
static volatile uint32_t g_press_t0;
static volatile uint8_t  g_pressing;

void EXTI13_IRQHandler(void)
{
    BSP_PB_IRQHandler(BUTTON_USER);
}

void BSP_PB_Callback(Button_TypeDef Button)
{
    uint32_t now = HAL_GetTick();
    uint32_t held;

    if (Button != BUTTON_USER) {
        return;
    }
    g_dbg_btn_edge++;

    if (HAL_GPIO_ReadPin(BUTTON_USER_GPIO_PORT, BUTTON_USER_PIN)
        == GPIO_PIN_SET) {
        if (!g_pressing) {
            g_pressing = 1u;
            g_press_t0 = now;
        }
        return;
    }

    if (!g_pressing) {
        return;                     /* 沒配對到的放開，忽略 */
    }
    g_pressing = 0u;

    held = now - g_press_t0;
    if (held < 30u) {
        return;                     /* 太短，是彈跳 */
    }
    if (held >= PRESS_LONG_MS) {
        g_dbg_btn_long++;
        g_req_pause = 1u;
    } else {
        g_dbg_btn_short++;
        g_bright_idx = (g_bright_idx + 1u) % BRIGHT_STEPS;
        brightness_set(BRIGHT_STEP[g_bright_idx]);
    }
}

/* 給 photo.c：有待處理的按鍵指令就別把這張解完了。 */
static bool ctrl_waiting(void)
{
    return (g_req_pause != 0u);
}

static void button_init(void)
{
    GPIO_InitTypeDef btn = {0};

    LCD_BL_CTRL_GPIO_CLK_ENABLE();      /* brightness_set 從中斷呼叫，不碰 RCC */
    (void)BSP_PB_Init(BUTTON_USER, BUTTON_MODE_EXTI);

    /* BSP 只設下降邊緣（放開才觸發），量不出按了多久。改成雙邊緣。 */
    BUTTON_USER_GPIO_CLK_ENABLE();
    btn.Pin   = BUTTON_USER_PIN;
    btn.Mode  = GPIO_MODE_IT_RISING_FALLING;
    btn.Pull  = GPIO_PULLDOWN;
    btn.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(BUTTON_USER_GPIO_PORT, &btn);
}

/* 設定背光亮度（0~100）。0 等同關螢幕，播放也會一起暫停。
 *
 * 全程只呼叫 BSP_LCD_SetBrightness()，「不碰」BSP_LCD_DisplayOn/Off ——
 * 那兩支是 ST 的不對稱陷阱：DisplayOff 會把背光腳（GPIOG15）從 LPTIM 的
 * PWM 替代功能改成一般 GPIO 並拉低，DisplayOn 卻完全不碰它。結果是
 * 「關得掉、開不回來」，而且腳位一旦離開 AF 模式，亮度調節就整個失效。
 *
 * SetBrightness 只改 LPTIM 的比較值（佔空比），那支腳從頭到尾維持 AF，
 * 所以 0% 就是 PWM 歸零＝背光全滅，100% 就是全亮，中間任意檔位都可用。 */
static void brightness_set(uint32_t pct)
{
    GPIO_InitTypeDef bl = {0};

    g_brightness = pct;
    g_screen_on  = (pct > 0u);

    /* 這支函式會從中斷裡被呼叫，所以不碰 RCC —— 時脈在 button_init() 開好。
     * 剩下的只有 GPIO 與 LPTIM 的暫存器寫入，沒有其他人同時在動這兩個周邊。 */
    bl.Pull  = GPIO_NOPULL;
    bl.Speed = GPIO_SPEED_FREQ_MEDIUM;
    bl.Pin   = LCD_BL_CTRL_PIN;

    if (pct == 0u) {
        /* BSP 的亮度公式在 0 會整數下溢：
         *     Pulse = (10001 * 0 / 100) - 1 = 0 - 1 -> 0xFFFFFFFF
         * 比較值變成天文數字，PWM 永遠不翻轉，背光根本關不掉。
         * 所以 0% 不走 PWM，直接把腳位切成一般輸出並拉低。 */
        bl.Mode = GPIO_MODE_OUTPUT_PP;
        HAL_GPIO_Init(LCD_BL_CTRL_GPIO_PORT, &bl);
        HAL_GPIO_WritePin(LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN,
                          GPIO_PIN_RESET);
        return;
    }

    /* 從 0% 回來時腳位還停在一般輸出，要先還原成 LPTIM 的替代功能，
     * 否則 SetBrightness 改了比較值也沒有用（腳位不歸 LPTIM 管）。 */
    bl.Mode      = GPIO_MODE_AF_PP;
    bl.Alternate = LCD_LPTIMx_CHANNEL_AF;
    HAL_GPIO_Init(LCD_BL_CTRL_GPIO_PORT, &bl);

    (void)BSP_LCD_SetBrightness(0, pct);
}

/* 放在每個迴圈裡。回傳 true 代表螢幕是亮的（可以接受觸控）。
 * USER 鍵每按一次降一檔，到 0 之後回到 100。 */
/* 亮度已經在中斷裡套用了，這裡只回報「螢幕是不是亮的」，
 * 決定要不要繼續解碼與接受觸控。 */
static bool screen_poll(void)
{
    return g_screen_on;
}

