chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
/* ------------------------------------------------------------------ */
/* 掃描                                                                */
/* ------------------------------------------------------------------ */

static bool is_jpeg(const char *name)
{
    size_t n = strlen(name);
    const char *p;

    if (n >= 4U) {
        p = name + n - 4;
        if (p[0] == '.' && (p[1] | 32) == 'j' && (p[2] | 32) == 'p' &&
            (p[3] | 32) == 'g') {
            return true;
        }
    }
    if (n >= 5U) {
        p = name + n - 5;
        if (p[0] == '.' && (p[1] | 32) == 'j' && (p[2] | 32) == 'p' &&
            (p[3] | 32) == 'e' && (p[4] | 32) == 'g') {
            return true;
        }
    }
    return false;
}

static void add_photo(const char *path, uint32_t top)
{
    char *slot;

    if (g_photo_count >= MAX_PHOTOS) {
        g_skipped_full++;
        return;
    }
    if (strlen(path) >= PATH_MAX) {
        g_skipped_long++;
        return;
    }
    slot = PLAYLIST_BASE + g_photo_count * PATH_MAX;
    strncpy(slot, path, PATH_MAX - 1U);
    slot[PATH_MAX - 1U] = 0;
    TOPIDX_BASE[g_photo_count] = (uint8_t)top;
    g_photo_count++;
}

/* DIR 與 FILINFO 依深度放 BSS：FILINFO 帶 UTF-8 長檔名緩衝區約 800 位元組，
 * 遞迴十層放堆疊會爆掉。 */
static void scan(uint32_t depth)
{
    size_t base = strlen(g_scan_path);

    if (depth >= MAX_DEPTH) {
        return;
    }
    if (f_opendir(&g_dir[depth], g_scan_path) != FR_OK) {
        return;
    }

    for (;;) {
        FILINFO *fi = &g_fno[depth];
        size_t len;

        if (f_readdir(&g_dir[depth], fi) != FR_OK || fi->fname[0] == 0) {
            break;
        }
        if (fi->fname[0] == '.' || (fi->fattrib & (AM_SYS | AM_HID))) {
            continue;
        }
        watchdog_feed();

        len = strlen(fi->fname);
        if (base + 1U + len + 1U > SCAN_PATH_LEN) {
            continue;
        }
        g_scan_path[base] = '/';
        memcpy(&g_scan_path[base + 1U], fi->fname, len + 1U);

        if (fi->fattrib & AM_DIR) {
            if (depth == 0U) {
                if (g_top_count >= MAX_TOP) {
                    g_scan_path[base] = 0;
                    continue;
                }
                g_cur_top = g_top_count;
                strncpy(g_top[g_cur_top].name, fi->fname, NAME_MAX - 1U);
                g_top[g_cur_top].name[NAME_MAX - 1U] = 0;
                g_top[g_cur_top].selected = true;   /* 預設全選 */
                g_top_count++;
            }
            scan(depth + 1U);
        } else if (is_jpeg(fi->fname) && depth > 0U && g_cur_top < MAX_TOP) {
            add_photo(g_scan_path, g_cur_top);
            g_top[g_cur_top].photos++;

            /* 掃幾萬個檔案要花上數十秒，畫面一直停在「載入中」會像當機。
             * 每 200 張更新一次數字，讓使用者看得到它在動。 */
            if ((g_photo_count % 200u) == 0u) {
                show_scan_progress();
            }
        }

        g_scan_path[base] = 0;
    }

    f_closedir(&g_dir[depth]);
    g_scan_path[base] = 0;
}

static uint32_t selected_photo_count(void)
{
    uint32_t n = 0;
    for (uint32_t i = 0; i < g_photo_count; i++) {
        uint32_t t = TOPIDX_BASE[i];
        if (t < g_top_count && g_top[t].selected) {
            n++;
        }
    }
    return n;
}

/* 依目前的勾選建立播放順序，然後洗牌。 */
/* true = 播放清單來自最愛，不是勾選的資料夾。
 *
 * 一定要是**狀態**而不是「建一次就好」：播完一輪會再呼叫 build_order()
 * 重洗牌，沒有這個旗標的話播完最愛就會偷偷跳回全部資料夾。 */
static bool g_fav_mode;

static void build_order(void)
{
    g_order_count = 0;
    for (uint32_t i = 0; i < g_photo_count; i++) {
        if ((i & 0xFFu) == 0u) {
            watchdog_feed();    /* 最愛模式每張都要比對，四千張要一點時間 */
        }
        if (g_fav_mode) {
            if (!fav_is(PLAYLIST_BASE + i * PATH_MAX)) { continue; }
        } else {
            uint32_t t = TOPIDX_BASE[i];
            if (!(t < g_top_count && g_top[t].selected)) { continue; }
        }
        g_order[g_order_count++] = (uint16_t)i;
    }

    if (!g_shuffle) {
        return;                     /* 循序：維持掃描到的順序 */
    }

    /* Fisher-Yates。每次進播放都重洗，播完一輪也重洗，
     * 所以同一批照片不會每輪都同一個順序。 */
    for (uint32_t i = g_order_count; i > 1U; i--) {
        uint32_t j = rnd() % i;
        uint16_t tmp = g_order[i - 1U];
        g_order[i - 1U] = g_order[j];
        g_order[j] = tmp;
    }
}

/* ------------------------------------------------------------------ */
/* 影片                                                                */
/* ------------------------------------------------------------------ */

#define MAX_VIDEOS      16U

/* 影片清單只掃根目錄。
 *
 * 影格包動輒上百 MB，放根目錄是自然的擺法；而遞迴掃描每個 .bin 都要開檔
 * 讀檔頭，深層目錄裡如果有一堆無關的 .bin 會拖很久。照片那邊需要遞迴是
 * 因為使用者的相簿本來就有目錄結構，影片沒有這個需求。 */
static video_info_t g_vids[MAX_VIDEOS];
static uint32_t     g_vid_count;
volatile uint32_t   g_dbg_autovideo;   /* SWD 可寫，見主迴圈 */
volatile uint32_t   g_dbg_audiotest;   /* SWD 寫入頻率（Hz）就播測試音 */
volatile uint32_t   g_dbg_autoplay;    /* SWD 可寫，直接開始放照片 */
volatile uint32_t   g_dbg_fakedirs;    /* SWD 可寫，測試資料夾清單捲動 */
volatile uint32_t   g_dbg_fakevids;    /* SWD 可寫，測試影片清單捲動 */
volatile uint32_t   g_dbg_favtest;     /* SWD 可寫，見 fav_selftest() */
volatile uint32_t   g_dbg_wrtest;      /* SWD 可寫，純寫入壓力測試 fav_stress() */
volatile uint32_t   g_dbg_cardreinit;  /* SWD 可寫，重新初始化卡片（換時脈用）*/

static bool ends_with_bin(const char *name)
{
    size_t n = strlen(name);

    if (n < 5u) {
        return false;
    }
    return (name[n - 4] == '.') &&
           (name[n - 3] == 'b' || name[n - 3] == 'B') &&
           (name[n - 2] == 'i' || name[n - 2] == 'I') &&
           (name[n - 1] == 'n' || name[n - 1] == 'N');
}

static void scan_videos(void)
{
    DIR     dir;
    FILINFO fno;

    g_vid_count = 0;
    if (f_opendir(&dir, "0:") != FR_OK) {
        return;
    }
    while (g_vid_count < MAX_VIDEOS) {
        if (f_readdir(&dir, &fno) != FR_OK || fno.fname[0] == 0) {
            break;
        }
        if ((fno.fattrib & AM_DIR) || !ends_with_bin(fno.fname)) {
            continue;
        }
        watchdog_feed();

        {
            video_info_t *v = &g_vids[g_vid_count];
            size_t        n = strlen(fno.fname);

