chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
        gfx_fill_rect(16, y, GFX_W - 32, ROW_H - 8, COL_PANEL);
        draw_checkbox(28, y + 9, g_top[idx].selected);
        draw_name_clipped(76, y + 15, g_top[idx].name,
                          GFX_W - 76 - 96, COL_TEXT);
        gfx_number_right(GFX_W - 28, y + 15, g_top[idx].photos, COL_DIM);
    }

    if (g_top_count > ROWS_VISIBLE) {
        gfx_text_center(GFX_W / 2, ROW_Y0 + ROWS_VISIBLE * ROW_H + 6,
                        "上下滑動看更多", COL_DIM);
    }

    gfx_pill(16, BTN_ALL_Y, GFX_W - 32, BTN_ALL_H, COL_PANEL);
    gfx_text_center(GFX_W / 2, BTN_ALL_Y + 14, "全部選取或取消", COL_TEXT);

    gfx_text(20, OR_Y + 14, "方向", COL_DIM);
    for (uint32_t o = 0; o < PHOTO_ORIENT_COUNT; o++) {
        int  x  = OR_X0 + (int)o * (OR_W + OR_GAP);
        bool on = ((uint32_t)photo_get_orientation() == o);
        gfx_pill(x, OR_Y, OR_W, OR_H, on ? COL_ACCENT : COL_PANEL);
        gfx_text_center(x + OR_W / 2, OR_Y + 14, ORIENT_NAME[o],
                        on ? COL_BG : COL_TEXT);
    }

    gfx_text(20, SEQ_Y + 14, "順序", COL_DIM);
    for (uint32_t k = 0; k < 2u; k++) {
        int  x  = OR_X0 + (int)k * (OR_W + OR_GAP);
        bool on = (g_shuffle == (k == 0u));

        gfx_pill(x, SEQ_Y, OR_W, SEQ_H, on ? COL_ACCENT : COL_PANEL);
        gfx_text_center(x + OR_W / 2, SEQ_Y + 14, SEQ_NAME[k],
                        on ? COL_BG : COL_TEXT);
    }

    gfx_text(20, IV_Y + 14, "間隔", COL_DIM);
    for (uint32_t s = 2; s <= 5; s++) {
        int  x  = IV_X0 + (int)(s - 2) * (IV_W + IV_GAP);
        bool on = (g_interval_s == s);
        gfx_pill(x, IV_Y, IV_W, IV_H, on ? COL_ACCENT : COL_PANEL);
        gfx_number(x + 20, IV_Y + 14, s, on ? COL_BG : COL_TEXT);
        gfx_text(x + 40, IV_Y + 14, "秒", on ? COL_BG : COL_TEXT);
    }

    {
        uint32_t n = selected_photo_count();
        int      x, w;

        bottom_rect(0, &x, &w);
        gfx_pill(x, BTN_GO_Y, w, BTN_GO_H, n ? COL_ACCENT : COL_PANEL);
        if (n) {
            gfx_text_center(x + w / 2, BTN_GO_Y + 12, "開始播放", COL_BG);
            if (bottom_slots() == 1) {      /* 只有一顆時才擠得下張數 */
                gfx_number_right(GFX_W - 40, BTN_GO_Y + 12, n, COL_BG);
            }
        } else {
            gfx_text_center(x + w / 2, BTN_GO_Y + 20,
                            (bottom_slots() > 1) ? "無照片"
                                                 : "沒有選取任何資料夾",
                            COL_DIM);
        }

        /* 收藏數是 0 就不畫這顆 —— 沒有內容的入口只會讓人按了失望。 */
        if (bottom_fav_idx() >= 0) {
            bottom_rect(bottom_fav_idx(), &x, &w);
            gfx_pill(x, BTN_GO_Y, w, BTN_GO_H, COL_PANEL);
            gfx_text_center(x + w / 2, BTN_GO_Y + 12, "最愛", COL_HEART);
        }
        if (bottom_vid_idx() >= 0) {
            bottom_rect(bottom_vid_idx(), &x, &w);
            gfx_pill(x, BTN_GO_Y, w, BTN_GO_H, COL_PANEL);
            gfx_text_center(x + w / 2, BTN_GO_Y + 12, "影片", COL_ACCENT);
        }
    }
}

/* 兩塊 buffer 都要畫，否則交換之後會看到上一次的內容。 */
static void repaint_select(void)
{
    for (int i = 0; i < 2; i++) {
        draw_select_screen();
        present();
    }
}

/* 回傳 true 表示要開始播放。 */
static bool select_screen(void)
{
    bool dirty = true;

    BBOX[12]++;

    for (;;) {
        int x, y;

        if (dirty) {
            repaint_select();
            dirty = false;
        }

        watchdog_feed();
        if (!sd_present()) {
            return false;               /* 卡片被拔掉，交回上層處理 */
        }
        /* 除錯旗標也要在這裡看：選單這個迴圈在等觸控時不會回到主迴圈，
         * 只在主迴圈檢查的話，SWD 設旗標永遠不會生效。 */
        if (g_dbg_favtest || g_dbg_wrtest || g_dbg_cardreinit ||
            g_dbg_audiotest || (BBOX[16] >> 16) == 0x5A5Bu) {
            return false;               /* 交回主迴圈去跑測試 */
        }
        if (g_dbg_autovideo && g_vid_count > 0u) {
            play_video(&g_vids[0]);
            dirty = true;
            continue;
        }
        /* 除錯：直接開始放照片，讓遠端也追得動暫停/繼續的流程。 */
        if (g_dbg_autoplay && selected_photo_count() > 0u) {
            build_order();
            return true;
        }
        if (!screen_poll()) {
            /* 螢幕關著時不吃觸控，否則會在看不見的情況下改到設定。 */
            nap(30);
            continue;
        }

        if (!read_touch(&x, &y)) {
            nap(15);
            continue;
        }

        if (y >= ROW_Y0 && y < ROW_Y0 + ROWS_VISIBLE * ROW_H) {
            /* 上下拖曳捲動、單純點一下才是勾選。
             *
             * 這個捲動先前**根本沒做** —— g_scroll 只有被讀、從來沒被寫過，
             * 所以第六個以後的資料夾看不到也選不到，而畫面上還寫著
             * 「上下滑動看更多」。用位移量分辨拖曳與點選，兩者不會互搶。 */
            uint32_t seen = HAL_GetTick();
            int      dy = 0, tx, ty;

            for (;;) {
                watchdog_feed();
                if (read_touch(&tx, &ty)) {
                    int d = ty - y;

                    if (((d < 0) ? -d : d) > ((dy < 0) ? -dy : dy)) {
                        dy = d;
                    }
                    seen = HAL_GetTick();
                } else if ((HAL_GetTick() - seen) > SWIPE_GAP_MS) {
                    break;
                }
                nap(10);
            }

            if (dy <= -SCROLL_MIN_DY || dy >= SCROLL_MIN_DY) {
                /* 往上拉（dy < 0）= 往清單後面看。不足一列也要動一列，
                 * 否則短拉會完全沒反應，使用者會以為壞掉。 */
                int32_t rows = (int32_t)(-dy / ROW_H);
                int32_t ns;

                if (rows == 0) {
                    rows = (dy < 0) ? 1 : -1;
                }
                ns = (int32_t)g_scroll + rows;
                if (ns < 0) { ns = 0; }
                if (ns > (int32_t)max_scroll()) { ns = (int32_t)max_scroll(); }
                if ((uint32_t)ns != g_scroll) {
                    g_scroll = (uint32_t)ns;
                    dirty = true;
                }
            } else {
                uint32_t i = g_scroll + (uint32_t)(y - ROW_Y0) / ROW_H;

                if (i < g_top_count) {
                    g_top[i].selected = !g_top[i].selected;
                    dirty = true;
                }
            }
        } else if (y >= BTN_ALL_Y && y < BTN_ALL_Y + BTN_ALL_H) {
            bool any = false;
            for (uint32_t i = 0; i < g_top_count; i++) {
                if (g_top[i].selected) {
                    any = true;
                }
            }
            for (uint32_t i = 0; i < g_top_count; i++) {
                g_top[i].selected = !any;
            }
            dirty = true;
        } else if (y >= OR_Y && y < OR_Y + OR_H) {
            for (uint32_t o = 0; o < PHOTO_ORIENT_COUNT; o++) {
                int bx = OR_X0 + (int)o * (OR_W + OR_GAP);
                if (x >= bx && x < bx + OR_W) {
                    photo_set_orientation((photo_orient_t)o);
                    dirty = true;
                }
            }
        } else if (y >= SEQ_Y && y < SEQ_Y + SEQ_H) {
            for (uint32_t k = 0; k < 2u; k++) {
                int bx = OR_X0 + (int)k * (OR_W + OR_GAP);

                if (x >= bx && x < bx + OR_W) {
                    g_shuffle = (k == 0u);
                    dirty = true;
                }
            }
        } else if (y >= IV_Y && y < IV_Y + IV_H) {
            for (uint32_t s = 2; s <= 5; s++) {
                int bx = IV_X0 + (int)(s - 2) * (IV_W + IV_GAP);
                if (x >= bx && x < bx + IV_W) {
                    g_interval_s = s;
                    dirty = true;
                }
            }
        } else if (y >= BTN_GO_Y && y < BTN_GO_Y + BTN_GO_H) {
            int bx, bw;

            if (bottom_vid_idx() >= 0) {
                bottom_rect(bottom_vid_idx(), &bx, &bw);
                if (x >= bx && x < bx + bw) {
                    wait_release();
                    video_list_screen();
                    dirty = true;
                    continue;
                }
            }
            if (bottom_fav_idx() >= 0) {
                bottom_rect(bottom_fav_idx(), &bx, &bw);
                if (x >= bx && x < bx + bw) {
                    g_fav_mode = true;
                    build_order();
                    if (g_order_count > 0u) {
                        wait_release();
                        return true;
                    }
                    /* 清單裡的照片一張都對不上：換過卡，或檔案被搬走了。 */
                    g_fav_mode = false;
                    show_message("最愛的照片都不在卡上",
                                 "可能換過卡或移動過檔案");
                    nap(2000);
                    dirty = true;
                    wait_release();
                    continue;
                }
            }
            bottom_rect(0, &bx, &bw);
            if (x >= bx && x < bx + bw && selected_photo_count() > 0U) {
                g_fav_mode = false;
                build_order();
                wait_release();
                return true;
            }
        }

        wait_release();
    }
}

