chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
/* ------------------------------------------------------------------ */
/* 播放                                                                */
/* ------------------------------------------------------------------ */

/* 掃描進度。數字會一直跳，讓使用者知道它在動而不是當掉了。 */
static void show_scan_progress(void)
{
    watchdog_feed();
    gfx_set_orientation(false);
    for (int i = 0; i < 2; i++) {
        gfx_clear(COL_BG);
        gfx_text_center(GFX_W / 2, GFX_H / 2 - 60, "掃描記憶卡", COL_TEXT);
        gfx_number_right(GFX_W / 2 + 20, GFX_H / 2, g_photo_count, COL_ACCENT);
        gfx_text(GFX_W / 2 + 28, GFX_H / 2, "張", COL_DIM);
        present();
    }
}

static void show_message(const char *line1, const char *line2)
{
    /* 腳印切到這裡面：這是開機腳印 5 之後唯一會做事的呼叫，而它做的三件事
     * （清畫面 = 寫 750KB PSRAM、畫字、等垂直消隱）風險完全不同。 */
    BBOX[26] = 10u;
    gfx_set_orientation(false);
    for (int i = 0; i < 2; i++) {
        BBOX[26] = 11u + (uint32_t)i * 10u;
        gfx_clear(COL_BG);
        BBOX[26] = 12u + (uint32_t)i * 10u;
        gfx_text_center(GFX_W / 2, GFX_H / 2 - 40, line1, COL_TEXT);
        if (line2) {
            gfx_text_center(GFX_W / 2, GFX_H / 2 + 10, line2, COL_DIM);
        }
        BBOX[26] = 13u + (uint32_t)i * 10u;
        present();
    }
    BBOX[26] = 30u;
}

/* 螢幕關著時停在這裡。回傳 false 代表卡片被拔掉。 */
static bool wait_screen_on(void)
{
    while (!screen_poll()) {
        watchdog_feed();
        if (!sd_present()) {
            return false;
        }
        nap(100);
    }
    return true;
}

/* 判斷觸控是短按還是長按。回傳 0=沒碰到，1=短按，2=長按。
 *
 * 短按暫停／繼續、長按回選單。原本短按就直接離開，結果想停下來看某一張時
 * 只能被踢回選單，反而看不到。 */


/* 暫停 / 繼續的視覺回饋。
 *
 * 按鍵操作沒有觸覺以外的回饋，使用者按下去看畫面沒變會不確定有沒有成功。
 * 在畫面中央閃一個圖示一秒再還原 —— 蓋住的區域先備份，還原後照片完整。 */
#define ICON_SZ     140
#define ICON_SAVE   ((uint16_t *)0x91F00000u)   /* 140x140x2 = 39KB */

/* 圖示置中的位置。畫布尺寸隨方向改變，所以不能是常數。 */
static int icon_x(void) { return (gfx_width()  - ICON_SZ) / 2; }
static int icon_y(void) { return (gfx_height() - ICON_SZ) / 2; }

static void icon_backup(bool restore)
{
    uint16_t *front = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);
    int       ix = icon_x(), iy = icon_y();

    /* 兩種方向下「哪個軸在實體記憶體裡連續」剛好相反：
     *   直立：邏輯 x 是實體列，所以沿著邏輯 y 走才連續
     *   橫向：畫布與面板同向，沿著邏輯 x 走就連續
     * 兩者都是每次搬 ICON_SZ 個連續像素，只差基底怎麼算。 */
    for (uint32_t i = 0; i < ICON_SZ; i++) {
        uint16_t *fb;
        uint16_t *sv = ICON_SAVE + i * ICON_SZ;

        if (gfx_is_landscape()) {
            fb = front + (uint32_t)(iy + (int)i) * PHYS_W + (uint32_t)ix;
        } else {
            fb = front + (uint32_t)(gfx_width() - 1 - (ix + (int)i)) * PHYS_W
                       + (uint32_t)iy;
        }
        if (restore) {
            memcpy(fb, sv, ICON_SZ * sizeof(uint16_t));
        } else {
            memcpy(sv, fb, ICON_SZ * sizeof(uint16_t));
        }
    }
}

static void flash_icon(bool paused)
{
    uint16_t *back  = gfx_framebuffer();
    uint16_t *front = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);
    int cx = gfx_width()  / 2;
    int cy = gfx_height() / 2;
    int ICON_X = icon_x(), ICON_Y = icon_y();

    icon_backup(false);
    gfx_set_framebuffer(front);

    /* 半透明底：把區域壓暗，圖示才浮得出來。 */
    for (int j = 0; j < ICON_SZ; j++) {
        for (int i = 0; i < ICON_SZ; i++) {
            uint16_t v = gfx_get_pixel(ICON_X + i, ICON_Y + j);
            gfx_pixel(ICON_X + i, ICON_Y + j,
                      (uint16_t)((((v >> 11) & 0x1Fu) >> 1) << 11 |
                                 (((v >> 5) & 0x3Fu) >> 1) << 5 |
                                 ((v & 0x1Fu) >> 1)));
        }
    }

    if (paused) {
        gfx_fill_rect(cx - 30, cy - 36, 20, 72, COL_TEXT);   /* ▮▮ */
        gfx_fill_rect(cx + 10, cy - 36, 20, 72, COL_TEXT);
    } else {
        /* ▶：逐列畫，寬度隨高度線性收斂 */
        for (int j = 0; j < 72; j++) {
            int half = (j < 36) ? j : (71 - j);
            gfx_fill_rect(cx - 24, cy - 36 + j, 12 + half, 1, COL_TEXT);
        }
    }

    gfx_set_framebuffer(back);
    nap(400);
    icon_backup(true);
}

/* 切換方向時閃一下目前的模式。
 *
 * 三段循環沒有回饋的話使用者不知道自己切到哪了 —— 沿用暫停圖示那套
 * 「壓暗背景、蓋上內容、一秒後還原」的機制。 */
static void flash_orient(void)
{
    uint16_t *back  = gfx_framebuffer();
    uint16_t *front = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);
    int cx = gfx_width() / 2;
    int cy = gfx_height() / 2;
    int ix = icon_x(), iy = icon_y();

    icon_backup(false);
    gfx_set_framebuffer(front);

    for (int j = 0; j < ICON_SZ; j++) {
        for (int i = 0; i < ICON_SZ; i++) {
            uint16_t v = gfx_get_pixel(ix + i, iy + j);
            gfx_pixel(ix + i, iy + j,
                      (uint16_t)((((v >> 11) & 0x1Fu) >> 1) << 11 |
                                 (((v >> 5) & 0x3Fu) >> 1) << 5 |
                                 ((v & 0x1Fu) >> 1)));
        }
    }
    gfx_text_center(cx, cy - 10, ORIENT_NAME[photo_get_orientation()],
                    COL_TEXT);

    gfx_set_framebuffer(back);
    nap(400);
    icon_backup(true);
}

/* 暫停中的滑動判定。
 * 邏輯座標：x 是橫向（0~479），y 是縱向（0~799，往下遞增）。
 * 縱向門檻設得比橫向大，因為畫面高是寬的 1.67 倍，手滑起來也比較長。 */
#define SWIPE_MIN_X  60
#define SWIPE_MIN_Y  120

/* 暫停：畫面停在目前這張。按鍵控制暫停/選單，滑動翻頁。 */
#define PAUSE_RESUME 0
#define PAUSE_MENU   1
#define PAUSE_PREV   2
#define PAUSE_NEXT   3
#define PAUSE_ROTATE 4
#define PAUSE_FAV    6           /* 愛心：加入／移出最愛（5 是拉桿）*/

/* ---- 暫停中的疊加層（覆刻影片播放器）----------------------------
 *
 * 版面與互動跟 play_video() 那套一致，兩邊看起來才是同一個介面：
 *
 *   上排   返回（左）   方向（中）   暫停（右，指示用）
 *   下方   拉桿：目前第幾張 / 共幾張，可以拖曳翻頁
 *
 * 點畫面暫停、再點一下（疊加層以外的地方）繼續。疊加層停留 OV_MS 之後
 * 自己收起來但**維持暫停** —— 收起只是讓照片看得完整。收起狀態下點一下
 * 只把它叫回來，不會直接觸發動作，否則使用者看不到按鈕在哪就先按到東西。
 *
 * 疊加層直接畫在「顯示中」的那塊 buffer 上，所以先把底下的畫面存起來、
 * 離開時原封還原 —— 重新解一張照片要 1.5 秒，存還原只要幾毫秒。
 *
 * **一律用直立座標**，不跟著照片的方向轉：AUTO 會逐張決定畫布方向，
 * 但使用者的手一直在同一個地方，會轉的應該只有照片。而且 read_touch()
 * 回傳的永遠是直立座標，統一成直立兩邊才對得上。 */

/* 借用照片路徑的 YCbCr 區。暫停中不解碼，而按下任何按鈕之後都會**先還原
 * 畫面才去解碼**，兩者不會互相踩到。 */
#define CTL_SAVE     ((uint16_t *)0x90600000u)

/* 上排四顆：返回 / 方向 / 愛心 / 暫停。
 *
 * 原本是三顆 120px 剛好排滿 480。加愛心之後改成 4x100 + 5x16 的間距，
 * 也是剛好 480 —— 不必動 OV_TOP_H，存還原的橫帶範圍完全不變。 */
#define OV_TOP_Y     36
#define OV_TOP_H     56
#define OV_PILL_W    100
#define OV_GAP       16
#define OV_BACK_X    OV_GAP                                  /* 16  */
#define OV_ORIENT_X  (OV_BACK_X   + OV_PILL_W + OV_GAP)      /* 132 */
#define OV_FAV_X     (OV_ORIENT_X + OV_PILL_W + OV_GAP)      /* 248 */
#define OV_PAUSE_X   (OV_FAV_X    + OV_PILL_W + OV_GAP)      /* 364 */

/* 拉桿與翻書手勢是**互補**的，不是二選一：
 *
 *   拉桿（下方那一帶）  粗調 —— 一下跳到大概的位置
 *   整片畫面左右拉      微調 —— 前一張／後一張
 *
 * 幾何沿用影片疊加層的常數，兩邊看起來才是同一套介面。 */
#define PB_X         40
#define PB_W         400
#define PB_Y         700
#define PB_H         14
#define PB_HIT       60
#define OV_BOT_Y     (PB_Y - 16)
#define OV_BOT_H     96

#define PAUSE_SEEK   5           /* 拉桿區域，拖曳定位 */
#define SEEK_MIN_DX  50          /* 水平拉多少才算翻頁 */

static uint32_t g_ov_index;      /* 疊加層要顯示的張數（由 pause_session 給） */
static uint32_t g_seek_target;   /* 拖曳拉桿結束時停在哪一張 */

/* 愛心的狀態，進 paused_loop() 之前由 pause_session 算好（純記憶體查表）。
 *
 * LOCKED 是清單檔載入失敗（讀不到也建不起來）的情況 —— 收藏會存不下來，
 * 所以那顆按鈕不接受點擊，免得使用者以為收藏成功了。 */
typedef enum {
    FAVBTN_OFF = 0,              /* 未收藏 */
    FAVBTN_ON,                   /* 已收藏 */
    FAVBTN_LOCKED,               /* 清單檔不可用 */
} favbtn_t;

static favbtn_t g_ov_fav;

/* 剛恢復播放的時刻。恢復之後短時間內不理會觸控 —— 否則同一次觸碰
 * （或放開瞬間的彈跳）會立刻又被播放迴圈判成「暫停」，症狀是
 * 「點一下播放不了」。實體鍵不會有這個問題，因為它是閂鎖旗標，
 * 不會被兩個迴圈各吃一次；使用者回報「只有實體鍵按得動」正是這個差別。 */
static uint32_t g_resume_ms;
#define RESUME_GUARD_MS  700u

/* 存還原一條橫帶（邏輯 y0 起算 h 列，整個畫布寬）。
 * 直立時邏輯 x 是實體列，所以沿著邏輯 y 走才連續。 */
static uint16_t *strip_backup(int y0, int h, uint16_t *sv, bool restore)
{
    uint16_t *front = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);

    for (int i = 0; i < (int)GFX_W; i++) {
        uint16_t *fb = front + (uint32_t)((int)GFX_W - 1 - i) * PHYS_W
                             + (uint32_t)y0;

        if (restore) { memcpy(fb, sv, (size_t)h * 2u); }
        else         { memcpy(sv, fb, (size_t)h * 2u); }
        sv += h;
    }
    return sv;
}

