chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
            if ((HAL_GetTick() - g_resume_ms) > RESUME_GUARD_MS &&
                read_touch(&tx, &ty)) {
                (void)tx; (void)ty;
                /* 不在這裡等放開 —— paused_loop_inner 進來就會吃掉殘留的
                 * 觸碰。在這裡等等於讓「點一下叫出控制列」多花兩百毫秒。 */
                return 3;
            }
        }
        nap(15);
    }
    return 0;
}

/* 暫停期間的互動，含翻頁。
 *
 * 翻頁之後要「留在暫停」，所以這裡是個迴圈：paused_loop() 回報翻頁就解碼
 * 並顯示，然後再進 paused_loop() 等下一個指令，直到使用者要繼續或回選單。
 *
 * 先前這段邏輯散在 wait_interval 和 slideshow 兩處，而 wait_interval 只判斷
 * 「是不是回選單」，翻頁的回傳值被當成沒事發生 —— 症狀就是滑動翻了頁卻
 * 立刻自動繼續播放。集中在一個地方就不會再漏。
 *
 * *cur 進來是目前顯示的索引，出去是最後顯示的那張。
 * 回傳 0 = 繼續播放，1 = 回選單。 */
static int pause_session(int32_t *cur)
{
    g_pause_flash = true;
    for (;;) {
        int a;

        /* 疊加層的拉桿要顯示目前是第幾張。 */
        g_ov_index = (uint32_t)((*cur < 0) ? 0 : *cur);

        /* 愛心的狀態要在畫疊加層之前算好。清單在記憶體裡，純查表不碰卡片。 */
        {
            const char *p = cur_photo_path();

            if (p == NULL || !fav_ready()) {
                g_ov_fav = FAVBTN_LOCKED;
            } else {
                g_ov_fav = fav_is(p) ? FAVBTN_ON : FAVBTN_OFF;
            }
        }

        a = paused_loop();
        int dir;
        uint32_t target, tries;
        photo_result_t r;

        if (a == PAUSE_MENU) {
            return 1;
        }
        if (a == PAUSE_RESUME) {
            g_resume_ms = HAL_GetTick();
            return 0;
        }
        if (a == PAUSE_SEEK) {
            /* 放開才解那一張。停在暫停，讓使用者可以接著再拖或翻頁。 */
            uint32_t t = g_seek_target;

            if (t < g_order_count &&
                photo_show(PLAYLIST_BASE + g_order[t] * PATH_MAX)
                    == PHOTO_OK) {
                present();
                *cur = (int32_t)t;
                note_decode(PHOTO_OK);
            }
            continue;
        }

        if (a == PAUSE_ROTATE) {
            /* 自動 <-> 固定，不再三段循環。離開自動時凍結在**目前這張的
             * 方向** —— 使用者看到什麼就固定什麼，畫面不會按一下就翻掉。 */
            if (photo_get_orientation() == PHOTO_ORIENT_AUTO) {
                photo_set_orientation(gfx_is_landscape()
                                      ? PHOTO_ORIENT_LANDSCAPE
                                      : PHOTO_ORIENT_PORTRAIT);
            } else {
                photo_set_orientation(PHOTO_ORIENT_AUTO);
            }
            /* 重畫目前這張，讓使用者當場看到新方向的結果。 */
            if (*cur >= 0 &&
                photo_show(PLAYLIST_BASE + g_order[*cur] * PATH_MAX)
                    == PHOTO_OK) {
                present();
            }
            flash_orient();
            continue;
        }

        /* 翻頁：往指定方向找一張解得開的，最多繞一圈。 */
        dir    = (a == PAUSE_PREV) ? -1 : 1;
        target = (uint32_t)((*cur < 0) ? 0 : *cur);
        tries  = 0;
        r      = PHOTO_ERR_READ;

        while (tries < g_order_count && !g_card_sick) {
            watchdog_feed();
            target = (target + g_order_count + (uint32_t)dir) % g_order_count;
            r = photo_show(PLAYLIST_BASE + g_order[target] * PATH_MAX);
            tries++;
            if (r == PHOTO_OK || r == PHOTO_ABORTED) {
                break;
            }
            note_decode(r);
        }
        if (r == PHOTO_OK) {
            present();
            *cur = (int32_t)target;
            note_decode(PHOTO_OK);
        }
    }
}

/* 播放。
 *
 * 解碼與顯示重疊：目前這張在螢幕上的時候，就先把下一張解進另一塊 buffer，
 * 時間到直接切換。這樣換頁是瞬間的，而且間隔設定值就是實際的展示時間 ——
 * 只要解碼比間隔快。解碼比間隔慢的話，展示時間就等於解碼時間，沒辦法更快。 */
static void slideshow(void)
{
    uint32_t pos = 0;           /* 下一張要解碼的 g_order 索引 */
    int32_t  cur = -1;          /* 顯示中的索引，-1 = 還沒顯示過 */

    BBOX[13]++;

    wait_release();

    for (;;) {
        photo_result_t r;
        uint32_t t0;

        watchdog_feed();

        /* 連續解不開太多張 —— 卡片是好的，是照片本身的格式不對。
         * **一定要在螢幕上說話**：不講的話畫面就只是不動，看起來跟當機
         * 一模一樣（相簿在幾十毫秒內一張張失敗，沒有東西可換）。
         * 使用者實際踩過，而相框放在桌上時沒有人會接 SWD 去讀計數器。 */
        /* 連續全部失敗 -> 這個資料夾整個不能播，停下來回選單。
         * 門檻取 min(清單大小, 8)：只有一兩張的資料夾失敗一次就等於全滅，
         * 寫死 8 的話永遠湊不到（使用者用「一張不支援的圖」測就踩到了）。 */
        if (g_bad_photo_run >= ((g_order_count < BAD_PHOTO_RUN)
                                ? g_order_count : BAD_PHOTO_RUN)) {
            g_bad_photo_run = 0;
            show_message("這些照片解不開",
                         "需要 baseline JPEG、單張 2MB 以內");
            HAL_Delay(4000);
            return;              /* 回選單，不要繼續空轉 */
        }

        /* 只有一兩張壞掉：**提示但不打斷**，而且整次播放只講一次。
         * 不講的話使用者永遠不知道有照片放不出來；每輪都講的話，
         * 四千多張裡混進一張壞檔就會讓相框變成警報器。 */
        if (g_bad_photo_run > 0u && !g_bad_photo_told) {
            g_bad_photo_told = true;
            show_message("有照片解不開，已跳過",
                         "需要 baseline JPEG、單張 2MB 以內");
            HAL_Delay(2000);
        }

        if (!sd_present() || g_card_sick || !wait_screen_on()) {
            return;
        }

        /* 解下一張：畫進 back buffer，此時前一張還在螢幕上。 */
        t0 = HAL_GetTick();
        r = photo_show(PLAYLIST_BASE + g_order[pos] * PATH_MAX);
        if (r != PHOTO_OK && r != PHOTO_ABORTED) {
            r = photo_show(PLAYLIST_BASE + g_order[pos] * PATH_MAX);
        }
        g_last_ms = HAL_GetTick() - t0;

        if (r == PHOTO_ABORTED) {
            /* 解碼途中按了暫停：這張不要了，停在螢幕上那張。
             * 半畫好的 back buffer 沒有 present，看不到。 */
            if (pause_session(&cur)) {
                return;
            }
            pos = (uint32_t)((cur < 0) ? 0 : (cur + 1)) % g_order_count;
            continue;
        }

        if (r == PHOTO_OK) {
            note_decode(PHOTO_OK);

            if (cur >= 0) {
                int w = wait_interval(g_last_ms);

                if (w == 1 || w == 2) {
                    return;             /* 回選單或卡片被拔掉 */
                }
                if (w == 3) {
                    if (pause_session(&cur)) {
                        return;
                    }
                    /* 暫停期間可能翻過頁，接著要播的是目前這張的下一張。
                     * back buffer 裡預解的那張作廢，重新解。 */
                    pos = (uint32_t)(cur + 1) % g_order_count;
                    continue;
                }
            }
            present();
            cur = (int32_t)pos;
        } else {
            /* 一張壞掉的照片不能讓相框停住，記錄之後直接換下一張。 */
            note_decode(r);
        }

