chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
        pos++;
        if (pos >= g_order_count) {
            build_order();              /* 播完一輪重新洗牌 */
            pos = 0;
        }
    }
}

/* ------------------------------------------------------------------ */

/* 卡片還插著但停止回應時的復原。
 *
 * 軟體重置**不會**切斷 SD 卡電源，所以光是重開機救不回來（README 記過
 * 這條）。要靠 BSP_SD_DeInit() 把 SDMMC 斷電、偵測腳 DeInit 掉，
 * 下一次 disk_initialize 才會從乾淨的狀態重跑完整的 BSP_SD_Init。
 *
 * 這是「卡片不回應」與「卡片被拔掉」共用的復原路徑 —— 差別只在前者
 * 使用者不必動手。 */
static void card_recover(void)
{
    g_dbg_card_recover++;
    show_message("記憶卡沒有回應", "重新初始化中");

    f_mount(NULL, g_drive, 0);          /* 丟掉 FatFs 的快取 */
    (void)BSP_SD_DeInit(0);
    for (int i = 0; i < 10; i++) {      /* 分段等，中間要餵狗 */
        watchdog_feed();
        HAL_Delay(100);
    }

    g_read_fail_run = 0;
    g_card_sick     = false;            /* 外層迴圈會重新掛載並掃描 */
}

/* 掛載並掃描一次。回傳 false 代表這輪不能播（沒卡、掛不起來、沒照片）。 */
static bool mount_and_scan(void)
{
    BBOX[8]++;                      /* 一輪開機裡進來很多次 = 在重掃迴圈裡 */
    g_top_count   = 0;
    g_photo_count = 0;
    g_order_count = 0;
    memset(g_top, 0, sizeof(g_top));

    g_stage = 31;
    g_err = (int32_t)f_mount(&g_fs, g_drive, 1);
    g_stage = 32;
    if (g_err != FR_OK) {
        show_message("記憶卡無法讀取", "請確認格式為 FAT32");
        return false;
    }

    /* 掛好了才能讀清單檔。放在掃描之前，這樣選單畫出來就知道有幾張最愛。 */
    fav_init(g_drive);

    g_stage = 4;
    strncpy(g_scan_path, g_drive, SCAN_PATH_LEN - 1U);
    g_scan_path[SCAN_PATH_LEN - 1U] = 0;
    {
        /* f_opendir 吃 "0:" 這種形式，結尾不要斜線。 */
        size_t n = strlen(g_scan_path);
        while (n > 0U && g_scan_path[n - 1U] == '/') {
            g_scan_path[--n] = 0;
        }
    }
    g_cur_top = MAX_TOP;
    {   /* 掃描耗時（毫秒）。使用者反映拔線後等太久，先量準再談怎麼改。 */
        uint32_t t0 = HAL_GetTick();
        scan(0);
        g_scan_ms = HAL_GetTick() - t0;
    }
    watchdog_feed();

    /* 測試捲動用：假裝有這麼多資料夾。**只存在記憶體**，不會動到卡片，
     * 重開機就沒了。不寫（維持 0）就完全等於不存在。 */
    if (g_dbg_fakedirs > g_top_count && g_dbg_fakedirs <= MAX_TOP) {
        for (uint32_t i = g_top_count; i < g_dbg_fakedirs; i++) {
            (void)snprintf(g_top[i].name, NAME_MAX, "測試資料夾 %u",
                           (unsigned)(i + 1u));
            g_top[i].photos   = 0;
            g_top[i].selected = false;
        }
        g_top_count = g_dbg_fakedirs;
    }

    /* 影片只掃根目錄，很快。放在照片掃描之後，這樣選單畫出來時就知道
     * 要不要顯示「影片」按鈕。 */
    scan_videos();

    /* 測試影片清單捲動用。跟 g_dbg_fakedirs 一樣**只存在記憶體**，
     * 假的那幾部 count = 0，點下去 video_open() 會被檔頭檢查擋掉。 */
    if (g_dbg_fakevids > g_vid_count && g_dbg_fakevids <= MAX_VIDEOS) {
        for (uint32_t i = g_vid_count; i < g_dbg_fakevids; i++) {
            (void)snprintf(g_vids[i].name, VIDEO_NAME_MAX, "測試影片 %u",
                           (unsigned)(i + 1u));
            g_vids[i].path[0]  = 0;
            g_vids[i].count    = 0;
            g_vids[i].fps_x100 = 2400u;
        }
        g_vid_count = g_dbg_fakevids;
    }
    watchdog_feed();

    BBOX[11] = g_photo_count;

    /* 只有影片沒有照片也算可用 —— 使用者可能就是拿它當影片播放器。 */
    if (g_photo_count == 0U && g_vid_count == 0U) {
        show_message("卡片裡沒有找到照片", "支援 jpg 與 jpeg");
        return false;
    }
    return true;
}

/* 卡片被拔掉之後的處理：卸載檔案系統，等使用者插回來。
 *
 * 一定要 f_mount(NULL) 卸載。FatFs 會把 FAT 表與目錄資訊快取在記憶體裡，
 * 換了一張卡還沿用舊快取，讀到的會是不存在的位置。 */
static void wait_for_card(void)
{
    f_mount(NULL, g_drive, 0);

    show_message("請插入記憶卡", "插入後會自動重新掃描");
    while (!sd_present()) {
        watchdog_feed();
        nap(100);
    }

    /* 插入的瞬間接點會彈跳，等它穩定再動卡片，否則初始化容易失敗。 */
    for (int i = 0; i < 10; i++) {
        watchdog_feed();
        nap(100);
    }
    show_message("讀取記憶卡", "載入中");
}

/* 從卡片根目錄找第一個 .wav。**不要寫死檔名** —— 交接文件寫的是
 * MOVIE10.wav，實際掃到的影片卻叫 video1.bin，猜錯就是白跑一輪燒錄。 */
static bool find_wav(char *out, size_t cap)
{
    DIR     dir;
    FILINFO fno;
    bool    found = false;

    if (f_opendir(&dir, g_drive) != FR_OK) { return false; }
    while (f_readdir(&dir, &fno) == FR_OK && fno.fname[0] != 0) {
        size_t n = strlen(fno.fname);

        if ((fno.fattrib & AM_DIR) == 0u && n >= 4u &&
            fno.fname[n - 4] == '.' && (fno.fname[n - 3] | 32) == 'w' &&
            (fno.fname[n - 2] | 32) == 'a' && (fno.fname[n - 1] | 32) == 'v') {
            (void)snprintf(out, cap, "%s%s", g_drive, fno.fname);
            found = true;
            break;
        }
    }
    (void)f_closedir(&dir);
    return found;
}

/* 第二步的驗證：從卡上串流一整個 WAV。
 *
 * 只驗音訊，不碰影片 —— 一次只加一個沒驗證過的東西（board-notes 第八章）。
 * 欠載次數（g_dbg_wav_under）比「聽起來有沒有卡」可靠得多。 */
static void wav_test(void)
{
    char path[PATH_MAX];

    if (!find_wav(path, sizeof(path))) {
        BBOX[112] = 0xE0000001u;   /* 卡上沒有 .wav */
        show_message("卡上找不到 .wav", 0);
        HAL_Delay(2000);
        return;
    }
    show_message("音訊串流測試", path);

    BBOX[112] = audio_wav_start(path, 90u) ? 1u : 0u;
    BBOX[113] = g_dbg_wav_step;
    BBOX[114] = g_dbg_wav_rate;
    BBOX[115] = g_dbg_wav_fmt;
    BBOX[116] = g_dbg_wav_bytes;

    while (audio_wav_active()) {
        watchdog_feed();
        audio_wav_pump();
        BBOX[117] = g_dbg_wav_fed;
        BBOX[118] = g_dbg_wav_under;
        BBOX[119] = g_dbg_wav_rderr;
        if (!sd_present()) { break; }
        {   /* 點一下畫面就停，不必等十分鐘或按 reset。 */
            int x, y;
            if (read_touch(&x, &y)) { break; }
        }
    }
    audio_wav_stop();
    BBOX[117] = g_dbg_wav_fed;
    BBOX[118] = g_dbg_wav_under;
    BBOX[119] = g_dbg_wav_rderr;
}

/* ------------------------------------------------------------------ */
/* 最愛的自動測試                                                      */
/* ------------------------------------------------------------------ */

/* SWD 寫 g_dbg_favtest = N 就跑一輪：挑 N 張平均散布的照片收藏，
 * 再用最愛模式把它們全部播一遍。不寫就完全等於不存在
 * （board-notes 16.3：實驗要由外部旗標觸發）。
 *
 * 為什麼要做成韌體端的自動測試而不是用 SWD 一步一步戳：
 * 每次 SWD 連線要一秒多，戳十幾步就好幾十秒，而且**節奏跟使用者用手點
 * 完全不同** —— 這次的失敗正是連續操作幾次之後才出現的，
 * 慢慢戳反而重現不了。 */
volatile uint32_t g_dbg_ft_step;        /* 正在收藏第幾張 */
volatile uint32_t g_dbg_ft_added;       /* 收藏成功幾張 */
volatile int32_t  g_dbg_ft_err;         /* 第一次失敗的錯誤碼 */
volatile uint32_t g_dbg_ft_failat;      /* 第幾張開始失敗 */
volatile uint32_t g_dbg_ft_order;       /* 最愛模式建出幾張的播放順序 */
volatile uint32_t g_dbg_ft_shown;       /* 播成功幾張 */
volatile uint32_t g_dbg_ft_showfail;
volatile uint32_t g_dbg_ft_wr;          /* 整輪用掉幾次 disk_write */
volatile uint32_t g_dbg_ft_done;        /* 1 = 跑完 */

extern volatile uint32_t g_sd_writes;

static void fav_selftest(uint32_t n)
{
    uint32_t step, w0;

    if (n == 0u || g_photo_count == 0u) {
        return;
    }
    if (n > g_photo_count) { n = g_photo_count; }
    step = g_photo_count / n;
    if (step == 0u) { step = 1u; }

    g_dbg_ft_done = 0; g_dbg_ft_step = 0; g_dbg_ft_added = 0;
    g_dbg_ft_err  = 0; g_dbg_ft_failat = 0; g_dbg_ft_order = 0;
    g_dbg_ft_shown = 0; g_dbg_ft_showfail = 0;
    w0 = g_sd_writes;

    show_message("最愛自動測試", "收藏中");

    for (uint32_t i = 0; i < n && !g_card_sick; i++) {
        const char  *path = PLAYLIST_BASE + (i * step) * PATH_MAX;
        fav_result_t r;

