chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
        g_dbg_ft_step = i + 1u;
        watchdog_feed();
        r = fav_add(path);
        if (r == FAV_OK) {
            g_dbg_ft_added++;
        } else if (g_dbg_ft_err == 0) {
            g_dbg_ft_err    = (int32_t)r;
            g_dbg_ft_failat = i + 1u;
        }
        /* 模擬使用者用手點的節奏，不要背對背灌。 */
        nap(300);
    }

    show_message("最愛自動測試", "播放中");
    g_fav_mode = true;
    build_order();
    g_dbg_ft_order = g_order_count;

    for (uint32_t i = 0; i < g_order_count && !g_card_sick; i++) {
        watchdog_feed();
        if (photo_show(PLAYLIST_BASE + g_order[i] * PATH_MAX) == PHOTO_OK) {
            present();
            g_dbg_ft_shown++;
            note_decode(PHOTO_OK);
        } else {
            g_dbg_ft_showfail++;
            note_decode(PHOTO_ERR_DECODE);
        }
    }
    g_fav_mode = false;

    g_dbg_ft_wr   = g_sd_writes - w0;
    g_dbg_ft_done = 1u;
}

void album_run(void)
{
    TS_Init_t ts = { .Width = PHYS_W, .Height = PHYS_H,
                     .Orientation = TS_SWAP_NONE, .Accuracy = 2 };
    bool wdt_reset;

    g_stage = 1;

    /* 睡眠時保持除錯連線。
     *
     * nap() 用 __WFI() 讓核心睡到下一次中斷，省電效果好，但代價是核心一睡
     * 除錯介面的時脈就被關掉 —— SWD 會直接失聯，報
     * "Unable to read device id from ROM table"，連讀個變數都做不到。
     * （還救得回來：mode=UR 是連線時按住重置，核心來不及睡。）
     *
     * 這一位元讓睡眠時的除錯時脈保持開啟。代價是省電效果打折，但這台是
     * 開發板、隨時要用 SWD 讀狀態，值得。真的要壓到最低耗電時再拿掉。 */
    HAL_DBGMCU_EnableDBGSleepMode();

    /* **光是 DBG_SLEEP 不夠**，還要開除錯時脈。
     *
     * 實測：DBGMCU->CR 讀出來 0x10036485（DBG_SLEEP 確實是 1），但相簿停在
     * 選單時 —— 那個迴圈每圈 nap(30)，等於幾乎整段時間都在 __WFI() ——
     * mode=HOTPLUG 連續 15 次全部連不上，報 "Unable to get core ID"。
     * 只有 mode=UR（連線時按住重置，核心來不及睡）連得上。
     *
     * DBG_SLEEP 只是「睡著時不要把除錯模組關掉」，DBGCKEN 才是給除錯模組
     * 時脈的那一個，重置後預設是 0。兩個都要。 */
    DBGMCU->CR |= DBGMCU_CR_DBGCKEN;

    /* 開啟週期計數器，rnd_mix() 拿它當高解析度的熵來源。 */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;

    /* 量 CN18 的 VBUS，用來判斷 USB 線插到電腦了沒（見 vbus.c）。
     * 失敗不影響相簿：vbus_mv() 之後一律回 0，就是「永遠沒插線」。 */
    vbus_init();
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    /* 上一輪是被看門狗打掉的嗎？旗標要在這裡讀，之後會被清掉。
     * 整個 RSR 也一起存進黑盒子 —— 只記「是不是看門狗」分不出
     * 「軟體重置」（usbdrive_request_switch 會呼叫 NVIC_SystemReset）
     * 與「按了 reset」與「掉電」，而這三者要用完全不同的方向去查。 */
    bbox_boot(RCC->RSR);
    wdt_reset = (__HAL_RCC_GET_FLAG(RCC_FLAG_IWDGRST) != 0u);
    __HAL_RCC_CLEAR_RESET_FLAGS();

    psram_mpu_init();
    screen_init();

    if (BSP_TS_Init(0, &ts) != BSP_ERROR_NONE) {
        show_message("觸控初始化失敗", 0);
    }
    button_init();
    photo_set_abort_check(ctrl_waiting);

    /* 初始化過程中設定腳位會產生假的邊緣事件，清掉再開始。 */
    g_req_pause = 0u;
    g_pressing  = 0u;

    g_bright_idx = 0u;
    brightness_set(BRIGHT_STEP[0]);   /* 100%，並給 LPTIM 明確初值 */

    g_stage = 2;
    if (!photo_init()) {
        show_message("JPEG 解碼器初始化失敗", 0);
        for (;;) { }
    }

    /* 插卡偵測腳要自己先設定好。
     *
     * BSP_SD_IsDetected() 只是讀 GPIO，不會設定它 —— 真正設定的是
     * BSP_SD_Init()。但主迴圈在掛載之前就會用 sd_present() 判斷有沒有卡，
     * 那時這支腳還沒被初始化過，讀到的是未定義狀態。實測沒插卡卻被判成
     * 有卡，於是走進掛載流程，最後顯示「記憶卡無法讀取，請確認格式為
     * FAT32」—— 訊息完全誤導。 */
    SD_DETECT_GPIO_CLK_ENABLE();
    {
        GPIO_InitTypeDef det = {0};
        det.Pin   = SD_DETECT_PIN;
        det.Mode  = GPIO_MODE_INPUT;
        det.Pull  = GPIO_NOPULL;
        det.Speed = GPIO_SPEED_FREQ_HIGH;
        HAL_GPIO_Init(SD_DETECT_GPIO_PORT, &det);
        HAL_Delay(10);              /* 讓腳位穩定再開始判斷 */
    }

    /* 開機時的音訊測試：請求放在黑盒子第 16 格（DTCM）。
     *
     * 為什麼不是用 g_dbg_audiotest：那個變數在 .bss，要用 SWD 寫它就得在
     * **執行中**連上板子，而 mode=HOTPLUG 現在完全連不上。在重置點寫的話
     * 又會被啟動碼清 .bss 的時候一起清掉（實測過，旗標寫進去就不見了）。
     * DTCM 兩邊都不吃虧：重置點寫得到、啟動碼也不會清它。
     *
     * 放在這裡是因為顯示與觸控（含 I2C）已經好了，而卡片還沒開始掛 ——
     * 音訊跟卡片是兩件獨立的事，先驗音訊就不必等掃卡。
     * 不寫請求就完全等於不存在（board-notes 16.3 的旗標觸發原則）。 */
    if ((BBOX[16] >> 16) == 0x5A5Au && (BBOX[16] & 0xFFFFu) <= 20000u) {
        uint32_t hz = BBOX[16] & 0xFFFFu;

        BBOX[16] = 0u;              /* 吃掉，不會自己重跑 */
        for (uint32_t i = 17u; i <= 25u; i++) { BBOX[i] = 0u; }  /* 清舊結果 */
        show_message("音訊測試", "耳機孔 CN16");
        if (audio_init(48000u, 90u)) {   /* 40 太小聲，實測聽不到 */
            (void)audio_tone(hz);
        }
        bbox_audio_snapshot();
    }

    g_stage = 30;
    BBOX[26] = 2u;              /* 音訊那段走完了，準備掛磁碟驅動 */
    if (FATFS_LinkDriver(&SD_BSP_Driver, g_drive) != 0) {
        show_message("磁碟介面初始化失敗", 0);
        for (;;) { }
    }

    /* 被看門狗打掉，代表上一輪卡在記憶卡裡出不來。
     *
     * 原本是「停住並要求使用者拔卡」，因為以為只有真正斷電才清得掉。
     * 但 BSP_SD_DeInit() 就會把 SDMMC 斷電、偵測腳 DeInit 掉，效果一樣 ——
     * 而且不必人在旁邊。相框放在桌上自己卡死、要人來拔卡才會動，
     * 是最糟的失敗模式。
     *
     * 先自己試一次；真的救不回來，下面的 mount_and_scan() 會失敗並顯示
     * 「記憶卡無法讀取」，那是個安靜等待的狀態，不會一直重置。 */
    if (wdt_reset) {
        show_message("記憶卡沒有回應", "重新初始化中");
        (void)BSP_SD_DeInit(0);
        HAL_Delay(1000);
    }

    watchdog_start();
    BBOX[26] = 4u;              /* 看門狗起來了，之後掛住會被自動重置 */

    /* 磁碟層等卡片的迴圈最長會佔住好幾秒（寫入逾時是 2 秒、還會重試），
     * 而看門狗只有 16 秒。第一版沒接這條，卡片一拒絕寫入就被重開，
     * 開機看到 IWDGRST 又停在「請拔出記憶卡再重新插入」—— 使用者看到的
     * 是「加入最愛失敗，然後連播放跟返回都不行」。 */
    sd_bsp_set_keepalive(watchdog_feed);

    g_stage = 3;
    BBOX[26] = 5u;              /* 準備進掛載/掃卡的主迴圈 */
    show_message("讀取記憶卡", "載入中");

    for (;;) {
        watchdog_feed();

        if (!sd_present()) {
            wait_for_card();
            continue;
        }
        if (!mount_and_scan()) {
            /* 掛不起來或沒照片：等使用者換一張卡再試。
             *
             * 但除錯旗標在這裡也要看得到 —— 拿一張沒有照片的卡來做寫入
             * 測試是很正常的事（比對不同卡片時就是這樣），只在正常路徑上
             * 檢查的話那些卡永遠測不到。 */
            while (sd_present()) {
                watchdog_feed();
                if (g_dbg_wrtest) {
                    uint32_t n = g_dbg_wrtest;

                    g_dbg_wrtest = 0;
                    show_message("寫入壓力測試", "進行中");
                    fav_stress(n);
                    continue;
                }
                if (g_dbg_cardreinit) {
                    g_dbg_cardreinit = 0;
                    break;              /* 跳出去重新掛載 */
                }
                HAL_Delay(200);
            }
            continue;
        }

#if DEBUG_ONE_SHOT
        /* 除錯：連續解好幾張（重現播放時的雙緩衝交替），最後停在一張上不動，
         * 方便用 SWD 把畫面完整抓下來。只解一張重現不了跨照片的問題。 */
        g_stage = 9;
        build_order();
        for (uint32_t k = 0; k < 6u && k < g_order_count; k++) {
            watchdog_feed();
            if (photo_show(PLAYLIST_BASE + g_order[k] * PATH_MAX) == PHOTO_OK) {
                note_decode(PHOTO_OK);
                present();
            } else {
                note_decode(PHOTO_ERR_DECODE);
            }
            HAL_Delay(300);
        }
        g_stage = 10;
        for (;;) {
            watchdog_feed();
            BSP_LED_Toggle(LD1);
            HAL_Delay(500);
        }
#else
        g_stage = 5;
        {
            bool first = true;

