chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
            while (sd_present() && !g_card_sick) {
                /* SWD 寫 g_dbg_favtest = N 就跑一輪最愛的自動測試。
                 * 選單迴圈看到旗標會先退出來，所以隨時觸發得到。 */
                if (g_dbg_favtest) {
                    uint32_t n = g_dbg_favtest;

                    g_dbg_favtest = 0;      /* 吃掉旗標，不會自己重跑 */
                    fav_selftest(n);
                    first = false;
                    continue;
                }
                /* 音訊第一步的驗證：SWD 寫 g_dbg_audiotest = 440 就播 A4。
                 * 只證明 BSP + I2S6 + WM8904 這條鏈路通不通，不碰 SD。 */
                if (g_dbg_audiotest) {
                    uint32_t hz = g_dbg_audiotest;

                    g_dbg_audiotest = 0;
                    g_dbg_aud_step |= AUD_STEP_TRIGGER;

                    show_message("音訊測試", "耳機孔 CN16");
                    if (audio_init(48000u, 40u)) {
                        (void)audio_tone(hz);
                    }
                    bbox_audio_snapshot();      /* 結果要活過下一次重置 */
                    first = false;
                    continue;
                }

                /* 音訊第二步：串流卡上的 WAV。請求放 DTCM（見 bbox_boot），
                 * 標籤跟測試音分開 —— 這一個需要卡片已經掛好，所以不能在
                 * 開機那條路上做。 */
                if ((BBOX[16] >> 16) == 0x5A5Bu) {
                    BBOX[16] = 0u;
                    wav_test();
                    first = false;
                    continue;
                }

                /* 改完 g_dbg_sdclkdiv 之後用這個讓新時脈生效，不必重燒。 */
                if (g_dbg_cardreinit) {
                    g_dbg_cardreinit = 0;
                    g_card_sick = true;     /* 讓下面的 card_recover 收尾 */
                    break;
                }
                /* 純寫入壓力測試：只量卡片，完全不碰最愛的邏輯。 */
                if (g_dbg_wrtest) {
                    uint32_t n = g_dbg_wrtest;

                    g_dbg_wrtest = 0;
                    show_message("寫入壓力測試", "進行中");
                    fav_stress(n);
                    first = false;
                    continue;
                }
                /* 自動開播：掃描完直接播，不必手動勾資料夾按開始。
                 *
                 * 資料夾本來就預設全選（見掃描那段），所以自動開播等於
                 * 「什麼都不做就會動」。從播放往下滑回到選單之後，
                 * 後續就走正常的手動流程 —— 想改設定隨時進得去。 */
                if (AUTO_PLAY && first && selected_photo_count() > 0u) {
                    first = false;
                    build_order();
                    slideshow();
                    continue;
                }
                first = false;
                /* 除錯用：SWD 寫 g_dbg_autovideo 非 0 就直接播第一部影片。
                 * 影片問題只能靠點螢幕重現，這個旗標讓遠端也追得動。
                 * 不寫就完全等於不存在（board-notes 16.3 的旗標觸發原則）。 */
                if (g_dbg_autovideo && g_vid_count > 0u) {
                    play_video(&g_vids[0]);
                    continue;
                }
                if (select_screen()) {
                    slideshow();
                }
            }
            if (g_card_sick) {
                card_recover();
            }
        }
#endif
        /* 跳出來代表卡片被拔掉了，或是它不再回應（card_recover 已處理）。 */
    }
}
